Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: The rationale for this choice is that there are only a few frames in a typical application and their parent-child relation are well understood by the programmer while it may be very difficult, if not impossible, to track down all the dialogs which may be popped up in a complex program (remember that some are created automatically by wxWidgets).
ja: このようにした理由は、普通のアプリケーションでは数個のフレームしか存在せず、プログラマはそれらの親子関係のことをよく理解している一方で、複雑なプログラムで表示されるすべてのダイアログを追跡することは、不可能でないにしても非常に難しいためです。 (いくつかのダイアログは wxWidgets によって自動的に生成されることを思い出してください)

source: The reason for making it a separate function from it is that usually there are a lot of trace messages, so it might make sense to separate them from other debug messages which would be flooded in them.
ja: これを別の関数とした理由は、通常、トレースメッセージを大量に出力するため、同じように大量に出力する他のデバッグ出力と区別することに意味があるはずだからです。

source: The reason for that is that m_helpCtrl is a member object and is thus destroyed from MyApp destructor.
ja: なぜなら、m_helpCtrl はメンバオブジェクトであり、MyApp のデストラクタで破棄されるためです。

source: The result of c_str() cannot be cast to char* but only to const char*. Of course, modifying the string via the pointer returned by this method has never been possible but unfortunately it was occasionally useful to use a const_cast here to pass the value to const-incorrect functions.
ja: c_str() の戻り値は char* にはキャストできず、const char* にのみキャスト可能です。もちろん、この関数の戻り値のポインタを通して文字列を変更することはできませんが、残念なことに、正しく const を受け取らない関数へ値を渡すために const_cast を使用するときに役立ちます。

source: The right functions for debug output.
ja: デバッグ出力に適切な関数です。

source: The same applies to wxString::c_str() if its result is used as a narrow string.
ja: 戻り値をナロー文字列として扱う場合には、wxString::c_str() についても同じことが言えます。

source: The same as EVT_CUSTOM, but expects a member function with a wxCommandEvent argument.
ja: EVT_CUSTOM と同じですが、wxCommandEvent を引数に取るメンバ関数を指定します。

source: The same as EVT_CUSTOM, but expects a member function with a wxNotifyEvent argument.
ja: EVT_CUSTOM と同じですが、wxNotifyEvent を引数に取るメンバ関数を指定します。

source: The same as EVT_CUSTOM, but responds to a range of window identifiers.
ja: EVT_CUSTOM と同じですが、ウィンドウ識別子を範囲で指定できます。

source: The same as EVT_CUSTOM_RANGE, but expects a member function with a wxCommandEvent argument.
ja: EVT_CUSTOM_RANGE と同じですが、wxCommandEvent を引数に取るメンバ関数を指定します。

source: The same as EVT_CUSTOM_RANGE, but expects a member function with a wxNotifyEvent argument.
ja: EVT_CUSTOM_RANGE と同じですが、wxNotifyEvent を引数に取るメンバ関数を指定します。

source: The same is done for converting to and from std::string and for the return value of c_str().
ja: 同じことが std::string との変換と、c_str() の戻り値に対しても行われます。

source: The search is applied down the entire chain of event handlers (usually the chain has a length of one).
ja: 次に、イベントハンドラの連鎖を辿って検索します。(通常、この連鎖の長さは 1 です)

source: The second bug is that returning output doesn't work.
ja: ふたつ目のバグは output を正しく返却できないことです。

source: The second form of this function takes the error code explicitly as the first argument.
ja: この関数の 2 番目の形式では第一引数として明示的にエラーコードを指定できます。

source: The second one is "native" wxString version and the last one is wxWidgets 1.xx way.
ja: 二番目の関数は wxString "ネイティブ" の関数で、最後の関数は wxWidgets 1.xx の形式です。

source: The second one is enough if you're happy with the standard wxLog message formatting (prepending "Error:" or "Warning:", timestamping &c) but just want to send the messages somewhere else.
ja: 標準的な wxLog メッセージの形式 (先頭に "Error:" か "Warning:" とタイムスタンプが付きます) で充分だが、メッセージを他の場所へ送りたい場合は 2 番目の関数を実装するだけで充分です。

source: The second one is the "native" wxString version and the last one is the wxWidgets 1.xx way.
ja: 二番目の関数は wxString "ネイティブ" の関数で、最後の関数は wxWidgets 1.xx の形式です。

source: The second type of validation is performed when the dialog is about to be dismissed, so if the default string contained invalid characters already, a dialog box is shown giving the error, and the dialog is not dismissed.
ja: ふたつ目の検証はダイアログが閉じられるときに行われます。そのため、デフォルト文字列がすでに不正な文字を含んでいる場合、エラーメッセージが表示され、ダイアログボックスが閉じられることはありません。

source: The server then responds and either vetoes the connection or allows it.
ja: そして、サーバが応答し、接続を拒否または許可します。

source: The short answer is that they're all very good generic mechanisms, but are not really adapted for wxWidgets, while the log classes are.
ja: 簡単に答えれば、それらの関数やストリームは確かに優れた汎用的な仕組みを持っていますが、本当に wxWidgets に適しているとは言えないためです。

source: The simplest of them is UTF-32 where each code unit is composed by 32 bits (4 bytes) and each code point is always represented by a single code unit (fixed length encoding).
ja: もっとも単純なものは UTF-32 です。これは各コード単位が 32 ビット (4 バイト) から成り、各コードポイントは常にひとつのコード単位で表現される固定長エンコーディングです。

source: The simplest solution is to cast the enum value to int, e.g.
ja: もっとも簡単な解決策は enum 値を int へキャストすることです。

source: The simplest way to ensure that this doesn't happen is to avoid conversions to char* completely by using wxString throughout your program.
ja: これが起きないようにする一番単純な方法は、wxString を使った char* への変換を避けることです。

source: The sizer of the border also must be made known, and it is the third parameter in the Add() method.
ja: ボーダーの太さも伝える必要があり、Add() 関数の第三引数に指定します。

source: The solution is to destroy HelpCtrl in OnExit:
ja: この解決策は OnExit で HelpCtrl を削除することです:

source: The solution is to use c_str(): just replace this line with
ja: 解決方法は c_str() を使用することです: この行を単純に次のように置き換えてください。

source: The solution is to use wxString::c_str().
ja: この解決方法は wxString::c_str() を使用することです。

source: The solution to this problem is also easy, just make the function return wxString instead of a C string.
ja: この問題の解決方法も簡単で、C 文字列の代わりに wxString を返却するようにするだけです。

source: The solution to this problem is also easy: just make the function return wxString instead of a C string.
ja: この問題の解決方法も簡単です: C 文字列の代わりに wxString を返却するようにするだけです。

source: The standard trace masks are given in wxLogTrace() documentation.
ja: 標準のトレースマスクは wxLogTrace() のドキュメントに記載しています。

source: The static event tables can only handle events in the object where they are defined so using Bind<>() is more flexible than using the event tables.
ja: 静的なイベントテーブルではそれが定義されたオブジェクトのイベントしか処理できないため、柔軟性は Bind<>() の方がイベントテーブルよりも上です。

source: The step 4 of the event propagation algorithm checks for the next handler in the event handler chain.
ja: イベント伝播アルゴリズムのステップ 4 では、イベントハンドラの連鎖内における次のイベントハンドラを確認します。

source: The stretch factor described in the last paragraph is used for the main orientation, i.e. when using a horizontal box sizer, the stretch factor determines how much the child can be stretched horizontally.
ja: 最後の段落で述べたストレッチ係数は主となる方向に対して適用されます。つまり、水平方向のボックスサイザーを使用している場合、ストレッチ係数は子コントロールを水平方向にどれだけ伸長させるかを決定します。

source: The symbols are defined in such a way that they can be combined in a 'bit-list' using the C++ bitwise-or operator.
ja: シンボルは C++ の ビット和 演算子で 'ビットリスト' として連結できるような形で定義されています。

source: The thickness of this border must be set explicitly, typically 5 points.
ja: ボーダーの太さは必ず明示的に指定する必要があり、デフォルトでは 5 ポイントです。

source: The thread API in wxWidgets resembles to POSIX1.c threads API (a.k.a. pthreads), although several functions have different names and some features inspired by Win32 thread API are there as well.
ja: いくつかの関数の名前が異なりますし、Win32 スレッド API にインスピレーションを受けた機能もありますが、wxWidgets のスレッド API は (pthread としても知られる) POSIX1.c のスレッド API によく似ています。

source: The thread sample shows that it is possible for many different threads to call GUI functions at once (all the threads created in the sample access GUI), but it is a very poor design choice for anything except an example.
ja: スレッドのサンプルは GUI 関数を同時に異なるスレッドから呼び出すことが 可能 なことを示していますが (サンプル中のすべてのスレッドから GUI にアクセスしています)、サンプル以外のデザインの選択肢はほとんどありません。

source: The type of unique identifiers (ID) used for wxWindow-derived classes.
ja: wxWindow を継承したクラスで使用される一意の識別子 (ID) の型。

source: The usage of the std::string compatible functions is strongly advised!
ja: std::string 互換の関数を使用することを強く推奨します!

source: The usage of these functions should be fairly straightforward, however it may be asked why not use the other logging facilities, such as C standard stdio functions or C++ streams.
ja: これらの関数の用途はかなり明確ですが、なぜ C の標準入出力関数や C++ のストリームといった他のロギング機能を使用しないのか疑問に思うかもしれません。

source: The usual, short, name of the switch or the option.
ja: スイッチやオプションのよくある、短い名前。

source: The validation and filtering of input is accomplished in two ways.
ja: 入力の検証とフィルタリングは 2 通りの方法で行われます。

source: The value must be in form widthxheight-depth.
ja: この値は 幅x高さ-色深度 の形式で指定する必要があります。

source: The verbose messages are the trace messages which are not disabled in the release mode and are generated by wxLogVerbose().
ja: 詳細メッセージとはリリースモードでも無効化されないトレースメッセージのことで、wxLogVerbose() によって生成されます。

source: The very best solution in precisely this case would be to use Alloc() function to preallocate, for example, len bytes from the beginning - this will lead to exactly one memory allocation being performed (because the result is at most as long as the original string).
ja: この例での最適な解決方法は Alloc() 関数を用いて、最初に例えば len バイトほど割り当てておくことです。これにより、メモリの割り当てが確実に 1 回だけ行われます。(なぜなら、変換結果の文字列の長さは最大でも元の文字列と同じだからです)

source: The very best solution in precisely this case would be to use wxString::Alloc() function to preallocate, for example, len bytes from the beginning - this will lead to exactly one memory allocation being performed (because the result is at most as long as the original string).
ja: この例での最適な解決方法は wxString::Alloc() 関数を用いて、最初に例えば len バイトほど割り当てておくことです。これにより、メモリの割り当てが確実に 1 回だけ行われます。(なぜなら、変換結果の文字列の長さは最大でも元の文字列と同じだからです)

source: The virtual size of a widget may be larger than its actual size and in this case scrollbars will appear to the let the user 'explore' the full contents of the widget.
ja: ウィジェットの仮想サイズは実際のサイズよりおそらく大きく、その場合にはユーザがウィジェットの内容全体を '探索' できるようにスクロールバーが表示されます。

source: The width of each column and the height of each row are calculated individually according to the minimal requirements from the respectively biggest child.
ja: それぞれの最大の子コントロールの必要とする最小サイズに応じて、各列の幅と各行の高さが個別に計算されます。

source: The word logging here has a broad sense, including all of the program output, not only non-interactive messages.
ja: ここでのロギングという言葉は広い意味を持っており、非対話形式のメッセージに限らず、プログラムの出力すべてを含んでいます。

source: The wxApp class represents the application itself when wxUSE_GUI=1.
ja: wxUSE_GUI=1 のとき、wxApp はアプリケーション自身を表します。

source: The wxDocChildFrame class provides a default frame for displaying documents on separate windows...
ja: wxDocChildFrame クラスは分割ウィンドウ上に表示されるドキュメントにデフォルトフレームを提供します。

source: The wxDocMDIChildFrame class provides a default frame for displaying documents on separate windows...
ja: wxDocMDIChildFrame クラスは分割ウィンドウ上に表示されるドキュメントにデフォルトフレームを提供します。

source: The wxDocMDIParentFrame class provides a default top-level frame for applications using the document/...
ja: wxDocMDIParentFrame クラスはドキュメント/ビューフレームワークを使用するアプリケーションにデフォルトのトップレベルフレームを提供します。

source: The wxDocManager class is part of the document/view framework supported by wxWidgets, and cooperates with the wxView, wxDocument and wxDocTemplate classes.
ja: wxDocManager クラスは wxWidgets のサポートしているドキュメント/ビューフレームワークの一部で、wxView、wxDocument、wxDocTemplate と一緒に使用します。

source: The wxDocParentFrame class provides a default top-level frame for applications using the document/vie...
ja: wxDocParentFrame クラスはドキュメント/ビューフレームワークを使用するアプリケーションにデフォルトのトップレベルフレームを提供します。

source: The wxScrolled class manages scrolling for its client area, transforming the coordinates according to...
ja: wxScrolled クラスはクライアントエリアのスクロール、スクロールバーの位置に合わせた座標の変換、表示領域にあわせたスクロール位置やつまみのサイズの設定といったことの管理を行います。

source: The wxString class has been completely rewritten for wxWidgets 3.0 and this change was actually the m...
ja: wxString クラスは wxWidgets 3.0 では完全に書き直されます。そして、この変更が新しいバージョンを wxWidgets 3.0 と呼ぶ主な理由です。

source: The wxTextFile is a simple class which allows to work with text files on line by line basis...
ja: wxTextFile はテキストファイルを行単位で扱うためのシンプルなクラスです。

source: The wxThreadHelper class is a mix-in class that manages a single background thread, either detached or joinable (see wxThread for the differences).
ja: wxThreadHelper クラスは分離済み、もしくは合流可能なひとつのバックグラウンドスレッドの管理を行なうミックスインクラスです。(wxThread を参照して違いを確認してください)

source: The wxWidgets approach to i18n closely follows the GNU gettext package.
ja: wxWidgets の採用している国際化の方法は GNU gettext パッケージの方式に従っています。

source: The wxWidgets library provides a mechanism that helps you avoid distributing many identical, only differently encoded, packages with your application (e.g. help files and menu items in iso8859-13 and windows-1257).
ja: wxWidgets ライブラリは (エンコーディングだけが異なる) 多くの同一なパッケージを配布しなくてもすむ仕組みを提供しています。(例えば iso8859-13 と windows-1257 を使用したヘルプファイルやメニュー項目などです)

source: The wxWidgets stream classes also provide some functionality not available in the standard library such as support for several compression formats and possibility to work with sockets or text controls (for output only in the latter case).
ja: また、wxWidgets のストリームクラスは標準ライブラリでは利用できない機能をいくつか提供しており、これにはいくつかの圧縮形式への対応や、ソケットやテキストコントロールの利用 (後者は出力のみです) が含まれます。

source: Then what do we do when a column sizer changes its width?
ja: では、垂直方向のサイザーの幅が変更された場合はどうすれば良いでしょうか?

source: Then you could use wxLog::SetComponentLevel() in the following ways:
ja: そして、以下のように wxLog::SetComponentLevel() を使用します:

source: There are also events which don't directly correspond to the user actions, such as wxTimerEvent or wxSocketEvent.
ja: wxTimerEvent や wxSocketEvent など、ユーザの操作に直接対応しないイベントも存在します。

source: There are currently five different kinds of sizers available in wxWidgets.
ja: 今のところ、wxWidgets では 5 種類のサイザーが利用可能です。

source: There are groups of entries and the entries themselves.
ja: コンフィグにはエントリとエントリのグループが存在します。

source: There are several advantages:
ja: これにはいくつかの利点があります:

source: There are several methods which may be overridden in the derived class to customize log messages handling: wxLog::DoLogRecord(), wxLog::DoLogTextAtLevel() and wxLog::DoLogText().
ja: ログメッセージの処理方法をカスタマイズするためには継承クラスでいくつかの関数をオーバーライドします: wxLog::DoLogRecord()、 wxLog::DoLogTextAtLevel()、wxLog::DoLogText()。

source: There are some predefined classes deriving from wxLog and which might be helpful to see how you can create a new log target class and, of course, may also be used without any change.
ja: wxLog を継承したクラスがいくつか事前に定義されており、新しいログターゲットクラスを作成する際の参考になると思います。もちろん、そのまま使用することも可能です。

source: There are two implementations of this DDE-like protocol: one using real DDE running on Windows only, and another using TCP/IP (sockets) that runs on most platforms.
ja: このDDE 風プロトコルには 2 種類の実装があります: ひとつは実際の DDE を使用する方法で、WIndows のみで実行できます。もうひとつは TCP/IP (ソケット) を使用する方法で、ほとんどのプラットフォームで実行できます。

source: There are two kinds of message catalogs: source catalogs which are text files with extension .po and binary catalogs which are created from the source ones with msgfmt program (part of gettext package) and have the extension .mo.
ja: メッセージカタログには次の 2 種類があります: 拡張子が .po でテキスト形式のソースカタログと、ソースカタログから msgfmt プログラム (gettext パッケージの一部です) を使って生成する、拡張子が .mo のバイナリカタログです。

source: There are two nasty bugs in these three lines.
ja: この 3 行の中にふたつの分かりにくいバグが含まれています。

source: There are two principal ways to handle events in wxWidgets.
ja: wxWIdgets でイベントを処理する方法として、主に 2 種類の方法があります。

source: There are:
ja: 以下にその一覧を示します:

source: There is a special virtual method in the C++ window classes called wxWindow::DoGetBestSize() that a class can override if it wants to calculate its own best size based on its content, however notice that usually it is more convenient to override DoGetBestClientSize(), see below.
ja: C++ のウィンドウクラスには wxWindow::DoGetBestSize() と呼ばれる特別な仮想関数があり、内容物に応じて独自の最適サイズを計算したい場合にはこの関数をオーバーライドすることができます。ただし、通常は DoGetBestClientSize() をオーバーライドした方が便利です。下記を参照してください。

source: There is a special virtual method in the C++ window classes called DoGetBestSize() that a class needs to override if it wants to calculate its own best size based on its content.
ja: C++ のウィンドウクラスには DoGetBestSize() と呼ばれる特別な仮想関数があり、内容物に基づいて独自の最適サイズを計算したい場合にはこの関数をオーバーライドする必要があります。

source: There is a static list of handlers which wxBitmap examines when a file load/save operation is requested.
ja: これらのハンドラの静的な一覧が存在し、ファイルの読み書きが要求された時に wxBitmap がこの一覧を調べます。

source: There is also a corresponding wxBITMAP() macro which allows to create the bitmaps in much the same way as wxICON() creates icons.
ja: これと対応するマクロに wxBITMAP() マクロがあり、wxICON() がアイコンを作成するのと同じ方法でビットマップを作成することができます。

source: There is also a corresponding wxBITMAP macro which allows to create the bitmaps in much the same way as wxICON creates icons.
ja: これと対応するマクロに wxBITMAP マクロがあり、wxICON がアイコンを作成するのと同じ方法でビットマップを作成することができます。

source: There is another class which might be useful when working with wxString: wxStringTokenizer.
ja: 他にも wxString と一緒に使用すると便利なクラスがあります: それが wxStringTokenizer です。

source: There is currently no way for the drop target to change this return code.
ja: 今のところ、ドロップ先でこの戻り値を変更することはできません。

source: There is however an important difference between the two mechanisms when you want to invoke the default behaviour, as implemented by the base class, from a derived class handler.
ja: しかし、継承クラスから基底クラスで実装されたデフォルトの振る舞いを呼び出すときに、このふたつの仕組みの間には重要な違いがあります。

source: There is no need for a separate type for strings though, because the standard wxString supports Unicode, i.e. it stores either ANSI or Unicode strings depending on the compile mode.
ja: だからといって、文字列に別々の型を使用する必要はありません。なぜなら、標準の wxString が Unicode に対応している (コンパイルモードに応じて ANSI 文字列か Unicode 文字列を格納する) ためです。

source: There should be a copy constructor, and a wxValidator::Clone function which returns a copy of the validator object.
ja: コピーコンストラクタと、バリデータオブジェクトのコピーを返却する wxValidator::Clone 関数を用意する必要があります。

source: Therefore, wxStreams have been added to wxWidgets so that applications can reliably compile and run on all supported platforms without dependence on a particular release of libg++.
ja: そのため、wxStreams が wxWidgets に追加されました。これにより、libg++ の特定のバージョンに依存することなく、対応するすべてのプラットフォームで確実にアプリケーションをコンパイルし、実行することができます。

source: These are methods of wxConnection.
ja: これらは wxConnection の関数です。

source: These are the ways that data can be transferred from one application to another.
ja: 他のアプリケーションへデータを転送するにはいくつかの方法があります。

source: These charsets usually differ in so many characters that it is impossible to use the same texts under all platforms.
ja: 通常、これらの文字コードは多くの文字で異なっているため、すべてのプラットフォームで同じテキストを使用することはできません。

source: These classes hopefully make writing MT programs easier and they also provide some extra error checking (compared to the native - be it Win32 or Posix - thread API), however it is still a non-trivial undertaking especially for large projects.
ja: これらのクラスによって、おそらくマルチスレッドプログラムの作成がより簡単になる上に、(ネイティブ (Win32 または Posix) スレッド API と比較して) いくつかの追加エラーチェックを行なってくれます。ただし、依然としてこれは簡単な仕事ではありませんし、巨大プロジェクトでは特にそうだと思います。

source: These classes will hopefully make writing MT programs easier and they also provide some extra error checking (compared to the native (be it Win32 or Posix) thread API), however it is still a non-trivial undertaking especially for large projects.
ja: これらのクラスによって、おそらくマルチスレッドプログラムの作成がより簡単になる上に、(ネイティブ (Win32 または Posix) スレッド API と比較して) いくつかの追加エラーチェックを行なってくれます。ただし、依然としてこれは簡単な仕事ではありませんし、巨大プロジェクトでは特にそうだと思います。

source: These events can be triggered by using the input devices (such as keyboard, mouse, joystick) directly or, more commonly, by a standard control which synthesizes such input events into higher level events: for example, a wxButton can generate a click event when the user presses the left mouse button on it and then releases it without pressing Esc in the meanwhile.
ja: これらのイベントは (キーボード、マウス、ジョイスティックなどの) 入力装置を利用して直接発生させるか、より一般的には、それらの入力イベントをより高レベルのイベントへ合成する標準コントロールを利用して発生させることができます: 例えば、wxButton はコントロール上でユーザが左マウスボタンを押下し、 (Esc を押下することなく) 離したときにクリックイベントを生成します。

source: These examples all assume that you are using a Unicode build of wxWidgets, although they will still compile in a non-Unicode build (they just won't convert anything).
ja: これらのサンプルはどれも wxWidgets の Unicode ビルドを使用していると仮定していますが、非 Unicode ビルドでもコンパイルすることは可能です。(その場合、何も変換されないだけです)

source: These flags can be used in combination with the alignment flags above as the second parameter of the Add() method using the binary or operator |.
ja: これらのフラグは論理和演算子 | を使用して上記のアライメントフラグと組み合わせることができ、Add() 関数の第二引数に指定します。

source: These functions are really implemented by the "IO" classes.
ja: これらのクラスは実際には "IO" クラスで実装されています。

source: These functions have a thread-safe implementation so that they can be used as they are for sending events from one thread to another.
ja: これらの関数はスレッドセーフに実装されているため、あるスレッドから他のスレッドへイベントを送信するのに使用できます。

source: These handlers will capture events before the control itself does (see How Events are Processed).
ja: これらのハンドラはコントロールでイベント処理が行われる前にイベントを捕まえます。(イベント処理の仕組み を参照)

source: These handlers will capture events before the control itself does.
ja: これらのハンドラはコントロールでイベント処理が行われる前にイベントを捕まえます。

source: These macros are used to handle scroll events from wxScrollBar, wxSlider,and wxSpinButton.
ja: これらのマクロは wxScrollBar、wxSlider、wxSpinButton から送信されるスクロールイベントを処理するために使用されます。

source: These macros handle wxListCtrl events.
ja: これらのマクロは wxListCtrl のイベントを処理します。

source: These macros handle wxTreeCtrl events.
ja: これらのマクロは wxTreeCtrl のイベントを処理します。

source: These macros handle special menu events (not menu commands).
ja: これらのマクロは特殊なメニューイベント (メニューコマンドではありません) を処理します。

source: These member functions are not virtual functions, but they are all similar in form: they take a single wxEvent-derived argument, and have a void return type.
ja: これらのメンバ関数は非仮想関数ですが、すべて同じ形式をとります: wxEvent を継承した引数をひとつ取り、戻り値の型は void です。

source: These member functions take an event argument, and the class of event differs according to the type of event and the class of the originating window.
ja: これらのメンバ関数はイベント引数を取りますが、その引数のクラスはイベントの型と発生元ウィンドウのクラスに応じて異なります。

source: These pairs are called surrogate.
ja: これらのコード単位の組のことを サロゲート と呼びます。

source: These sizers will be discussed one by one in the text below.
ja: これらのサイザーについて、ひとつずつ説明していきます。

source: They also appear in a message box by default (but it can be changed, see below).
ja: この関数もデフォルトでメッセージボックスを表示します。 (ただし、この振る舞いは変更可能です。以下を参照してください)

source: They are also normally shown to the user, but don't interrupt the program work.
ja: 警告メッセージは普通、ユーザに通知されますが、プログラムの動作を妨げません。

source: They are hierarchical in the sense that "foo/bar/baz" component is supposed to be a child of "foo".
ja: ログコンポーネントは "foo/bar/baz" コンポーネントが "foo" コンポーネントの子として扱われるという意味では階層的です。

source: They are just simple methods of the class that take as a parameter a reference to an object of a wxEvent-derived class and have no return value (any return information is passed via the argument, which is why it is non-const).
ja: これらのイベントハンドラは単純なメンバ関数であり、wxEvent を継承したクラスのオブジェクトへの参照を引数に取り、戻り値はありません。(情報を返却する場合は引数のオブジェクトを経由して行います。これが引数を const にしていない理由です)

source: They are not normally shown to the user because they present little interest, but may be activated, for example, in order to help the user find some program problem.
ja: ユーザがこれらのメッセージに関心を示すことがないため、通常はユーザに通知されません。しかし、ユーザがプログラムの問題を見つける際の手助けとして有効化されます。

source: They can be used to create a wxString from arbitrary binary data without supposing that it is in current locale encoding, and then get it back, again, without any conversion or, rather, undoing the conversion used by wxString::From8BitData().
ja: これらの関数は任意のバイナリデータをもとに wxString を作成しますが、その際にバイナリデータが現在のロケールのエンコーディングで符号化されていると仮定しません。そして、なんらかの変換や wxString::From8BitData() で行われた変換の逆変換を行うことなく、元のバイナリデータを取得することができます。

source: They were especially designed for this usage and, although may probably be used for many other things as well, should be limited to it.
ja: これらのクラスはこの用途に特化して設計されており、他のことにも使用されるかもしれませんが、この用途に限定して使用するべきです。

source: They will go into the status bar of the active or specified (as the first argument) wxFrame if it has one.
ja: これらのメッセージはアクティブまたは第一引数で指定された wxFrame がステータスバーを持つ場合に、ステータスバーへ出力されます。

source: This abstract class is the base for classes that help wxWidgets perform run-time layout adaptation of...
ja: この抽象クラスは wxWidgets が実行時にダイアログのレイアウト適応を行なうのを支援するクラスの基底です。
